Repository: jiya-talreja/multi_language_detection
Catalog: backend/input/opus/en-hi.tmx
Source language: en
Languages: hi

source: That child is only four, but he can already count to 100.
hi: वह बच्चा हालांकि केवल चार साल का ही है, वह अभी से ही सौ तक गिनती कर सकता है।

source: Don't force the child to eat.
hi: बच्चे को ज़बरदस्ती मत खिलाओ।

source: The children were well looked after.
hi: बच्चों की देखभाल अच्छी तरह से की जाती थी।

source: You must keep an eye on the child.
hi: तुम्हे बच्चे पर नज़र रखनी पड़ेगी।

source: I'm wondering whether to take on that job.
hi: मैं सोच रहा हूँ कि नौकरी लूँ या नहीं लूँ।

source: He couldn't get the job.
hi: उसको नौकरी नहीं मिल पायी।

source: It won't take long to do the job.
hi: इस काम को करने में ज़्यादा देर नहीं लगेगी।

source: The work was well done in a way.
hi: काम एक तरह से अच्छी तरह से किया गया था।

source: The job must be finished by 3 p.m.
hi: यह काम दोपहर तीन बजे से पहले खतम हो जाना चाहिए।

source: We cannot do the work in a day.
hi: हम यह काम एक दिन में नहीं कर सकते।

source: The mountain is covered with snow.
hi: पहाड़ पर बर्फ़ बिछी हुई है।

source: Please haul on the rope.
hi: रस्सी को खींचिए।

source: The factory will cease operations next month.
hi: फ़ैक्टरी में काम अगले महीने से रुक जाएगा।

source: I could not bear to see the scene.
hi: मैं वह द्रिश्य देख नहीं सका।

source: It was my brother that made the mistake.
hi: वह ग़लती मेरे भ्राता की थी.

source: You know the rest of the story.
hi: बाकी की कहानी तो तुम जानते ही हो।

source: Then Mike tells Hiroshi to fasten his seat belt.
hi: फिर माइक हिरोशी को अपनी सुरक्षा पेटी बांधने बोलता है।

source: Don't play with that key!
hi: उस चाबी के साथतानी मत करो!

source: The dog kept barking all night.
hi: कुत्ता रातभर भौंकता रहा।

source: Please feed the dog every day.
hi: कुत्ते को रोज़ खिलाईएगा।

source: I like the dog.
hi: मुझे यह कुत्ता अच्छा लगता है।

source: The building is built of marble of a most lovely color.
hi: यह इमारत बहुत ही सुंदर रंग के संगमरमर की बनी है।

source: May I talk with you in private about the matter?
hi: मैं तुम्हारे साथ इस बारे में अकेले में बात कर सकता हूँ क्या?

source: I am pleased with the result.
hi: मैं नतीजे से खुश हूँ।

source: The hole is about five feet across.
hi: गड्ढा पाँच फ़ुट चौड़ा है।

source: The policeman observed the man open the door.
hi: पुलीसवाले ने आदमी को दरवाज़ा खोलते देखा।

source: The instant he saw the policeman, he ran away.
hi: वह पुलिस अफ़सर को देखते ही भाग गया।

source: The plan has been successful so far.
hi: प्लान अब तक कामयाब रहा है।

source: This rite is part of their religion.
hi: यह उनके धर्म की एक रिति है।

source: The machine generates a lot of electricity.
hi: वह मशीन बहुत सारी बिजली बनाती है।

source: There's a rumor in the air that the firm is going into bankruptcy.
hi: हवा में एक अफ़वाह है कि उस कारोबार का दिवालिया होने वाला है।

source: The school was founded seventy years ago.
hi: स्कूल सत्तर साल पहले स्थापित हुआ था।

source: The cliff is almost vertical.
hi: चट्टान लगभग बिलकुल सीधी है।

source: I've seen that picture before.
hi: मैंने वह चित्र पहले भी देखा है।

source: How many cars has that company bought?
hi: कम्पनी ने कितनी गाड़ियाँ ख़रीदीं हैं?

source: The company is on the verge of bankruptcy.
hi: कंपनी दिवाले के हद पर है।

source: The company gave him a gold watch in acknowledgement of his services.
hi: कम्पनी ने उसकी सेवाओं की पहचान में उसे सोनी की घड़ी दी।

source: The flower died for want of water.
hi: फ़ूल पानी की कमी से मर गया।

source: The fire devoured the town.
hi: आग ने नगर को तबाह कर दिया।

source: The house was ablaze.
hi: घर आग में लिपटा हुआ था।

source: The house was altogether destroyed by the fire.
hi: घर को आग ने सरासर नष्ट कर दिया।

source: There is a river beside the house.
hi: घर के बगल में एक नदी है।

source: The house is said to be haunted.
hi: लोग कहते हैं कि इस घर में भूत हैं।

source: Its value had trebled.
hi: उसकी कीमत तिगुनी हो चुकी थी।

source: The king ruled the country for years.
hi: राजा ने कई साल देश पर राज किया।

source: That movie theater always shows good movies.
hi: उस सिनेमा हॉल में हमेशा अच्छी फ़िल्में लगतीं हैं।

source: You should have seen the film.
hi: तुम्हें वह फ़िल्म देखनी चाहिए थी।

source: The rumor spread throughout the country.
hi: अफवाह पूरे देश में फैल गयी।

source: The crow flew away.
hi: कौआ उड़ गया।

source: The spaceship was never to return to the earth.
hi: वह हवाई जहाज़ पृथ्वीपर वापस लौटनेवाला नहीं था.

source: The committee has something to do with this plan.
hi: इस समिति का इस प्लान से कुछ लेना-देना है।

source: Whoever wins the race will receive the prize.
hi: जो भी रेस जीतेगा ईनाम उसी का होगा।

source: The apple has begun to decay.
hi: वह सेव सड़ने लगा है।

source: The apple trees set very well.
hi: सेव के पेड़ों में बहुत सारे फल लग गए।

source: The hen lays an egg almost every day.
hi: मुर्गी लगभग हर दिन एक अंडा देती है।

source: The twin girls are so much alike that I can't tell one from the other.
hi: जुड़वा बहनें एक-दूसरे से इतनी मिलती-जुलतीं हैं कि मैं उनमें फ़र्क नहीं बता सकती।

source: The solution of the puzzle required no time.
hi: पहेली को सुलझाने में बिलकुल भी समय नहीं लगा।

source: The mystery still remains unsolved.
hi: वह आज भी एक रहस्य है।

source: You look nice in that dress.
hi: तुम उस ड्रेस में अच्छी लगती हो।

source: The tiger laid in the middle of the cage.
hi: बाघ पिंजरे के बीचों-बीच पड़ा हुआ था।

source: I met him then for the first time.
hi: मैं उसे तब पहली बार मिली।

source: I could not tell what I should do then.
hi: मैं बता नहीं पाया के तब मुझे क्या करना होगा.

source: The shirt needs pressing.
hi: इस कमीज़ को इस्त्री की ज़रूरत है।

source: The monkey climbed up a tree.
hi: बंदर पेड़ पर चढ़ा।

source: How did you get tickets for the concert?
hi: तुम्हें कॉनसर्ट की टिकटें कैसे मिलीं?

source: The occasion demands a cool head.
hi: इस बात को ठंडे दिमाग़ से सोचना होगा।

source: I found the glass empty.
hi: मुझे गिलास खाली मिला।

source: The money should be distributed to those in need.
hi: यह पैसा ज़रूरतमंदों में बाँट देना चाहिए।

source: The air conditioner makes too much noise.
hi: एसी बहुत आवाज़ करता है।

source: The rumor is true to some extent.
hi: वह अफ़वाह किसी हद तक सच है।

source: You will soon learn to speak English well.
hi: तुम जल्दी ही अच्छी तरह से अंग्रेज़ी बोलना सीख जाओगे।

source: The two mountains are of equal height.
hi: दोनों पहाड़ों की उंचाई एक सामान है।

source: The two languages have a lot in common.
hi: इन दो भाषाओं में बहुत सारी समानताएं हैं।

source: How is the weather there?
hi: वहाँ का मौसम कैसा है?

source: I'll be there at five p.m.
hi: मैं वहाँ शाम के पाँच बजे पहुँच जाऊँगा।

source: And there is not even enough water.
hi: और वहाँ पर पानी भी काफ़ी नहीं है।

source: And they would play hide and go seek.
hi: और फिर वे लुका-छुप्पी खेलने जाया करते थे।

source: How long will it take to get there?
hi: वहाँ पहुँचने में कितनी देर लगेगी?

source: Will you please go there?
hi: आप वहाँ जाएँगे क्या?

source: Do you go there by bus or by car?
hi: तुम वहाँ बस से जाते हो या गाड़ी से?

source: It hardly ever rains there.
hi: यहाँ पर मुश्किल से कभी बारिश होती है।

source: There was no one there besides me.
hi: वहाँ मेरे अलावा और कोई नहीं था।

source: Because there was plenty of water...
hi: क्योंकि पानी की कोई भी कमी नहीं थी...

source: You can see the whole city from here.
hi: तुम यहाँ से पूरा शहर देख सकते हो।

source: Don't be so self-assertive.
hi: इतने सयाने मत बनो.

source: That a boy!
hi: शाबाश!

source: Under the circumstances I cannot allow the request.
hi: इन परिस्तिथियों को ध्यान में रखकर मैं इस प्रस्ताव का स्वीकार नहीं कर सकता।

source: You must get rid of such a habit.
hi: तुम्हे इस तरह की आदत तोड़ देनी चाहिए।

source: He might at least apologize.
hi: उसको कम-से-कम माफ़ी तो माँगनी चाहिए।

source: Smog causes plants to die.
hi: स्मॉग से पेड़-पौधों की मौत होती है।

source: Excuse me, but can you help me?
hi: माफ़ कीजिएगा, आप मेरी मदद कर सकते हैं क्या?

source: Excuse me, I'm lost.
hi: माफ़ कीजिएगा, मैं खो गई हूँ।

source: Excuse me, is this seat taken?
hi: माफ़ कीजिएगा, यहाँ कोई बैठा हुआ है क्या?

source: I like sport.
hi: मुझे स्पोर्ट्स अच्छे लगते हैं।

source: Not all birds can fly.
hi: सारे पंछी उड़ नहीं सकते।

source: All the boys ran away.
hi: सभी लड़के भाग गए।

source: Spanish is her native language.
hi: उसकी मातृ-भाषा स्पेनी है।

source: Spain was one of the world's mightiest nations.
hi: स्पेन दुनिया के सबसे ताकतवर राष्ट्रों में से एक था।

source: The strikers called off the strike of their own accord.
hi: हड़तालियों ने अपने-आप ही हड़ताल बंद कर दी।

source: Stella really is dead!
hi: स्टेला सचमुच मर गई है!

source: Terrific!
hi: बढ़िया!

source: Brilliant!
hi: चतुर!

source: Wow!
hi: वाह!

source: Start at once, and you will be in time for school.
hi: अगर बिलकुल अभी निकल पड़ोगे तो टाईम पर स्कूल पहुँच जाओगे।

source: I'm coming.
hi: मैं आ रहा हूँ।

source: I fly into a rage easily.
hi: मैं जल्दी गुस्सें में आ जाता हूँ.

source: You had better go at once.
hi: तुम्हे तुरंत जाना चाहिए।

source: I'm coming at once.
hi: मैं अभी आता हूँ।

source: The population of Sweden is on the increase.
hi: स्वीडन की जनसंख्या बढ़ रही है।

source: Singapore has one big problem.
hi: सिंगापुर में एक बड़ी समस्या है।

source: I'm from Singapore.
hi: मैं सिंगापुर से हूँ।

source: John is my junior by two years.
hi: जॉन मुझसे दो साल छोटा है।

source: John left for France yesterday.
hi: जॉन फ्रांस के लिए कल रवाना हुआ।

source: John asked Mary whether she would like to go shopping in the afternoon.
hi: जॉन ने मेरी से पूछा कि वह दोपहर में उसके साथ बाज़ार जाना चाह्ती है क्या।

source: John lives in New York.
hi: जॉन न्यूयॉर्क में रहता है।

source: John caught a tiger and shot two lions.
hi: जॉन ने एक बाघ पकड़ा और दो शेर मारे।

source: John will not answer the question.
hi: जॉन सवाल का जवाब नहीं देगा।

source: John, who is the youngest in a family of seven, is the apple of his parents' eyes.
hi: जॉन, जो सात बच्चों के परिवार में सबसे छोटा है, वह अपने माता-पिता के आँखों का तारा है.

source: No one came to the party except John and Dick.
hi: जॉन और डिक छोड़ के पार्टी में कोई नहीं आया।

source: Mr Johnson ran fastest of the three.
hi: तीनों में से श्री जॉनसन सबसे तेज़ भागें।

source: Remove your shirt and lie down.
hi: अपनी कमीज़ उतार कर लेट जाओ।

source: Jack is three years senior to me.
hi: जैक मुझसे तीन साल बड़ा है।

source: Jack may have taken my umbrella by mistake.
hi: जैक ने मेरा छाता शायद ग़लती से ले लिया है।

source: Jack keeps a cat and a parrot at home.
hi: जैक घर पर एक बिल्ली और एक तोता रखता है।

source: Which do you like better, the Giants or the Dragons?
hi: तुम्हें ज़्यादा कौन अच्छे लगते हैं, जायंट्स या ड्रैगन्स?

source: Can I have the key now, please?
hi: मुझे अब चाबी मिल सकती है क्या?

source: Jim can read Japanese.
hi: जिम को जापानी पढ़ने आती है।

source: Jim resembles his father.
hi: जिम अपने पापा पर जाता है।

source: Say hello to Jimmy.
hi: जिमी से मिलो।

source: Keep an eye on the baby for a while.
hi: बच्चे पर ध्यान रखना थोड़ी देर के लिए।

source: After some hesitation, he laid the book on the desk.
hi: थोड़ी हिचकिचाहट के बाद, उसने किताब को मेज़ पर रखा।

source: Stand still and keep silent.
hi: शांति से खड़े रहो।

source: Hold still or you'll be shot.
hi: हिलो मत नहीं तो गोली लग जाएगी।

source: But they will come here tomorrow.
hi: पर वे कल यहाँ आएँगे।

source: Jane looks happy.
hi: जेन खुश लगती है।

source: The jeans looked none the cleaner for having been washed.
hi: जीन्ज़ धुलकर भी साफ़ नहीं लग रहीं थीं।

source: Sally and I work in the same office.
hi: सैली और मैं एक ही दफ़्तर में काम करते हैं।

source: To make matters worse, he fell ill.
hi: और-तो-और वह बीमार भी पड़ गया।

source: Sam joined the army when he was eighteen.
hi: सैम अठारह साल की उम्र में आर्मी में भर्ती हुआ था।

source: The Sahara is the largest desert in the world.
hi: सहारा दुनिया का सबसे बड़ा रेगिस्तान है।

source: Now I'll introduce my parents to you.
hi: अब मैं तुम्हारी मुलाक़ात अपने पापा-मम्मी से करवाता हूँ।

source: Mary was looking for you at that time.
hi: मेरी उस समय तुम्हें ढूँढ रही थी।

source: Do you know your size?
hi: क्या आपको अपना नाप पता है?

source: It's now my turn.
hi: अब मेरी बारी है।

source: Come on, sit down and rest your weary legs.
hi: आओ, बैठो और अपने थके-हारे पैरों को आराम करने दो।

source: Come on! I will best you.
hi: आओ! मैं तुम्हें हार का स्वाद चखाऊँगा।

source: Let's play baseball!
hi: चलो बेसबॉल खेलतें हैं।

source: Here, please have a seat.
hi: यहां, बैठिये।

source: Now, go have a good time. The work can wait.
hi: जाओ मौज करो। काम थोड़ी देर रुक सकता है।

source: Do you have rice?
hi: तुम्हारे पास चावल है क्या?

source: I am much obliged to you for your help.
hi: मैं आपकी मदद के लिए बहुत आभारी हूँ।

source: What's your home phone number?
hi: तुम्हारे घर का फ़ोन नम्बर क्या है?

source: I am deeply grateful to you for your kindness.
hi: मैं आपकी करुणा के लिए अत्यंत आभारी हूँ.

source: How do you feel today?
hi: तुम्हे आज कैसा लग रहा है?

source: Hello, Tom.
hi: नमस्ते, टॉम।

source: Never have I been so happy.
hi: मैं कभी इतना खुश नहीं हुआ हूँ।

source: Your parents are not to blame for such a result.
hi: ऐसे नतीजे के लिए तुम्हारे माता-पिता पर दोष नहीं डाला जा सकता।

source: Who doesn't know such a simple proverb?
hi: इस तरह की आम कहावत को कौन नहीं जानता?

source: You had better not go out in this bad weather.
hi: अच्छा होगा कि तुम इस बुरे मौसम में बाहर न जाओ।

source: Keep hold of my hand if you're afraid.
hi: मेरा हाथ पकड़लो अगर तुम्हे डर लग रहा है तो।

source: Columbus argued that he could reach India by going west.
hi: कोलम्बस ने सोचा कि वह पश्चिम दिशा में जाकर भारत पहुँच सकता था।

source: Whose book is this?
hi: यह किसकी किताब है?

source: It's an absolute waste of time to wait any longer.
hi: और इंतेज़ार करना समय की सरासर बर्बादी होगी।

source: I can't take any more work.
hi: मुझसे और काम नहीं किया जाएगा।

source: These are very old books.
hi: ये किताबें काफ़ी पुरानी हैं।

source: What old books these are!
hi: ये कितने पुराने किताबें हैं!

source: Instead of laying off these workers, why don't we just cut their hours?
hi: इन कर्मचारियों को नौकरी से निकालने की बजाय क्यों न हम इनके काम करना का समय कम करदें?

source: These trees were planted by them.
hi: ये पेड़ उन्होंने लगाए थे।

source: You can borrow these books from the library for a week.
hi: आप ये किताबें पुस्तकालय से एक हफ़्ते के लिए ले सकते हैं।

source: These books are mine.
hi: ये किताबें मेरीं हैं।

source: Whose books are these?
hi: ये क्या किताबें हैं?

source: Learn these words, one by one.
hi: इन शब्दों को एक-एक करके याद करो।

source: These questions are easy to answer.
hi: इन सवालों का जवाब देना आसान है।

source: All those flowers look alike.
hi: वे सभी फूल एक जैसे ही दिखते हैं।

source: These dogs are big.
hi: ये कुत्ते बड़े हैं।

source: Can you tell the difference between these two pictures?
hi: तुम इन दो तस्वीरों में अंतर बता सकते हो?

source: I cannot walk any farther.
hi: मैं और नहीं चल सकती।

source: This is an apple, too.
hi: यह भी सेव है।

source: This must be a real diamond.
hi: यह असली हीरा होगा।

source: This is a book.
hi: यह एक किताब है।

source: This is the flag of Japan.
hi: यह जापान का झंडा है।

source: This is a map.
hi: यह नक्शा है।

source: Whose umbrella is this?
hi: यह छाता किसका है?

source: This is a house to let, not to be sold.
hi: यह घर किराय वाला वाला है, बिकने वाला नहीं है।

source: This is a picture of my sister.
hi: यह मेरी बहन की तस्वीर है।

source: This is the village where my father was born.
hi: यह वह गाँव है जहाँ मेरे पिताजी पैदा हुए थे।

source: This is my bag.
hi: यह मेरा बस्ता है।

source: This is what I found in the cave.
hi: मुझे गुफ़ा में ये मिला।

source: This is for you.
hi: यह तुम्हारे लिए है।

source: What a beautiful flower this is!
hi: क्या सुंदर फूल है यह!

source: This is Mary's dog.
hi: यह मेरी का कुत्ता है।

source: This is a dress of Mary's own making.
hi: यह ड्रेस मेरी ने खुद बनाई है।

source: This is the very book that I wanted to read.
hi: यह वही किताब है जिसे मैं पढ़ना चाह्ता था।

source: What a tall tree this is!
hi: कितना लम्बा पेड़ है यह!

source: This is a very beautiful flower.
hi: यह एक बहुत ही सुंदर फूल है।

source: This feels like silk.
hi: यह रेशम जैसा लगता है।

source: This is a plant unique to this country.
hi: यह पौधा केवल इस देश में ही पाया जाता है।

source: This is as large as that.
hi: यह उसके जितना बड़ा है।

source: What is the difference between this and that?
hi: इस और उस में क्या अंतर है?

source: Can you tell me what size this is?
hi: क्या आप मुझे बता सकते हैं कि यह किस नाप का है?

source: This is mine, and that's yours.
hi: यह मेरा है और वह तुम्हारा है।

source: This is what I need.
hi: यह वही चीज़ है जिसकी मुझे ज़रूरत है।

source: This is the house where I lived when I was a child.
hi: यह वह घर है जिसमें मैं रहता था जब मैं छोटा था।

source: This is the book about which I told you.
hi: यह वह किताब है जिसके बारे में मैंने तुम्हें बताया था।

source: These are the rules; act accordingly.
hi: ये नियम हैं। इनके मुताबिक कम करिए।

source: This is what we call "tempura".
hi: इसी को हम "तेम्पुरा" कहते हैं।

source: Golf isn't my cup of tea.
hi: गोल्फ़ मेरे बस की बात नहीं है।

source: I'm sorry, but I can't hear you well.
hi: माफ़ कीजिएगा, पर मैं आपको ठीक से सुन नहीं पा रहा हूँ।

source: A rubber ball bounces because it is elastic.
hi: रबड़ की गेंद उछलती है क्योंकि वह लचीली होती है।

source: This food is too salty.
hi: यह खाना कुछ ज़्यादा ही नमकीन है।

source: This theory is too difficult for me to comprehend.
hi: यह सिद्धांत मेरे समझने से बाहर है।

source: This medicine will clear up your cold.
hi: यह दवाई तुम्हारा गला साफ़ कर देगी।

source: This medicine will take the pain away.
hi: यह दवाई दर्द को दूर कर देगी।

source: This medicine will do you good!
hi: यह दवाई तुम्हारा भला करेगी!

source: All the answers to this question were wrong.
hi: इस प्रश्न के सारे उत्तर ग़लत थे।

source: This tree bears no fruit.
hi: इस पेड़ पर फल नहीं लगते हैं।

source: May I leave this book with you?
hi: मैं यह किताब तुम्हारे पास छोड़ूँ?

source: You had better not read this book.
hi: तुम यह किताब न ही पढ़ो बेहतर होगा।

source: This is a book often read by adults.
hi: इस किताब को अक्सर वयस्क पढ़ा करते हैं।

source: Is this book yours?
hi: क्या यह किताब तुम्हारी है?

source: This book is older than that one.
hi: यह किताब उस किताब से पुरानी है।

source: This book contains many pictures.
hi: इस किताब में बहुत सारी तस्वीरें हैं।

source: It's this book.
hi: यह किताब है।

source: This hat does match the brown dress.
hi: यह टोपी उस ब्राऊन ड्रेस के साथ जचती नहीं है।

source: This law does not apply in Japan.
hi: यह कानून जापन में लागू नहीं होता।

source: There are no houses around here.
hi: यहां आसपास कोई घरें नहीं है।

source: Apples are produced in this district.
hi: इस ज़िला में सेवों का उत्पाद किया जाता है।

source: Do you know this part of the city very well?
hi: तुम शहर के इस हिस्से को अच्छी तरह से जानते हो क्या?

source: Don't lean against this wall.
hi: इस दीवार पर मत झुँको।

source: How do you interpret these sentences?
hi: तुम इन वाक्यों का क्या माईने निकालते हो?

source: This story is worth reading.
hi: यह कहानी पढ़ने लायक है।

source: There is a desk in this room.
hi: इस कमरे में मेज़ है।

source: Don't you think the air conditioner is turned up too high in here?
hi: तम्हें नहीं लगता कि एसी कुछ ज़्यादा ही तेज़ चल रहा है?

source: This cloth adheres to the skin.
hi: यह कपड़ा खाल से चिपकता है।

source: Do you want to watch this program?
hi: तुम यह कार्यक्रम देखना चाहते हो क्या?

source: What is in this box?
hi: इस डब्बे में क्या है?

source: This box contains five apples.
hi: इस डब्बे में पाँच सेव हैं।

source: Choose between these two.
hi: इन दोनों में से किसी एक को चुनो।

source: A part of this land is mine.
hi: इस ज़मीन का हिस्सा मेरा है।

source: This train is bound for Boston.
hi: यह ट्रेन बॉस्टन के लिए रवाना हो रही है।

source: It is better to ignore this point.
hi: बेहतर होगा कि इस बात को अनदेखा किया जाए।

source: Stamps are not sold in this store.
hi: यहां डाक टिकटें नहीं बेची जातीं हैं।

source: What do you call this bird?
hi: इस पक्षी का नाम क्या है?

source: This bird lives neither in Japan nor in China.
hi: यह पक्षी न तो जापान में रहता है न चीन में।

source: This town is increasing in population.
hi: इस नगर कि जनसंख्या बढ़ रही है।

source: What is the meaning of this word?
hi: इस अल्फाज का मतलब क्या है?

source: In this village, they lived a happy life.
hi: इस गांव में वे सुख की ज़िन्दगी जीए।

source: Something is wrong with this washing machine.
hi: इस वॉशिंग मशीन में कुछ खराबी है।

source: This river is beautiful.
hi: यह नदी बहुत सुन्दर है।

source: This river is dangerous to swim in, in July.
hi: इस नदी में जुलाई के महीने में तैरना खतरनाक होता है।

source: This river is one mile across.
hi: यह नदी एक मील चौड़ी है।

source: The number of fish caught in this river was very small.
hi: इस नदी में बहुत कम मछलियाँ पकड़ीं गईं।

source: This stone is too heavy to lift.
hi: यह पत्थर ज्यादा ब्जंदर है उठाने के लिए.

source: I'm tired of living this life.
hi: मैं इस ज़िन्दगी को जीकर थक गया हूँ।

source: What would the world do without tea?
hi: दुनिया चाय के बिना क्या करेगी?

source: There is nothing on earth that is not affected by the sun.
hi: विष्व में ऐसी कोई भी वस्तु नहीं है जिसपर सूर्य का प्रभाव न पड़ता हो।

source: Do you like this color?
hi: यह रंग पसंद है क्या?

source: The novel is very exciting.
hi: यह उपन्यास बहुत रोमांचक है।

source: Who is the author of this story?
hi: इस कहानी का लेखक कौन है?

source: Please get these papers out of the way.
hi: कृपया यह कागज़ रास्ते से हटाओ.

source: I don't like studying in this heat.
hi: मुझे इस गर्मी में पढ़ाई करना अच्छा नहीं लगता।

source: Write back to me as soon as you get this letter.
hi: तुम्हें जैसे ही यह पत्र मिले मुझे लिखकर जवाब देना।

source: Will you stamp this letter for me?
hi: तुम इस चिट्ठी पर स्टैम्प लगादोगे क्या?

source: This car was made in Japan.
hi: यह गाड़ी जापान में बनी थी।

source: This car isn't worth repairing.
hi: यह कार मुरम्मत करवाने योग्य नहीं है.

source: This car has been used for the past ten years.
hi: इस गाड़ी का पिछले दस साल से इस्तेमाल हो रहा है।

source: We need to look for a gas station because this car will soon run out of gas.
hi: हमे पेट्रोल पम्प ढूँढना चाहिए क्योंकि गाड़ी में पेट्रोल खतम होने वाला है।

source: This car is better as compared with that one.
hi: उस गाड़ी के मुकाबले में यह गाड़ी ज़्यादा अच्छी है।

source: This car has enough power to go up the mountain easily.
hi: गाड़ी में आसानी से पहाड़ चढ़ने लायक जान है।

source: I want this photograph developed as soon as possible.
hi: मुझे यह तस्वीर जल्द-से-जल्द बनवानी है।

source: Every time I see this photo, I think of my father.
hi: जब भी में यह फोटो देखता हूँ, मुझे मेरे पिता की याद आती है।

source: Have a good look at this picture and tell me whether or not you can find me in it.
hi: इस तस्वीर को अच्छी तरह से देखो और बताओ कि तुम मुझे ढूँढ पा रहे हो कि नहीं।

source: I will tell him about it when he comes next time.
hi: जब वह अगली बार आएगा, मैं उसे इसके बारे में बाताऊँगा।

source: This watch is broken.
hi: यह घड़ी टूटी हुई है।

source: This watch was given me by my uncle.
hi: यह घड़ी मुझे मेरे मामा ने दी थी।

source: Don't tell Father about this.
hi: पिताजी को इसके बारे में मत बताओं।

source: How do you interpret this poem?
hi: इस कविता क्या आप क्या अर्थ निकालते हैं?

source: This poem was written by a nameless poet.
hi: यह कविता किसी बेनाम कवी ने लिखी थी।

source: This poem was originally written in French.
hi: यह कविता सबसे पहले फ़्रानसीसी में लिखी गई थी।

source: This paper has very good absorption.
hi: यह कागज़ बहुत अच्छे से सोखता है।

source: What is the height of this mountain?
hi: इस पहाड़ की ऊँचाई कितनी है?

source: This country has four seasons.
hi: इस देश में चार मौसम हैं।

source: There were no Japanese in this country.
hi: इस देश में कोई जापानी नहीं थे।

source: Every fifth person has a car in this country.
hi: इस देश में हर पाँचवे व्यक्ति के पास गाड़ी है।

source: Let the tea draw for ten minutes.
hi: चाय को दस मिनट के लिए उबलने दीजिए।

source: This old table is still in use.
hi: पुरानी मेज़ अभी भी इस्तेमाल में है।

source: This word comes from Greek.
hi: यह शब्द ग्रीक से आता है।
